{
  "Todos": [
    {
      "id": 1,
      "todo": "Check Todo"
    },
    {
      "id": 2,
      "todo": "New Todo"
    }
  ],
  "Books": [
    {
      "id": 1,
      "name": "dorucak u Trstu"
    }
  ],
  "Blogs": [
    {
      "id": 1,
      "title": "Real-time automotive – bezbedni sistemi budućnosti",
      "title2": "MotionWise",
      "excerpt": "U sledećoj deceniji automobilska industrija će se suočiti sa razmerama promena koje nisu viđene zadnjih 100 godina. Ovu promenu će pokretati prvenstveno četiri međusobno jačajuća trenda, tj. koncept autonomnih, povezanih, električnih i deljenih vozila (autonomous, connected, electrical, shared - ACES)",
      "text": " <p> Jedan od ključnih faktora koji doprinose snažnom ukupnom rastu tržišta softvera je povećanje njegove složenosti u domenima na koje najviše utiču ACES trendovi. U autonomnoj vožnji složenost je uzrokovana sve većim brojem namenskih funkcija automatizovanog softvera za vožnju, kao i složenošću osnovnog hardvera, operativnih sistema i komunikacionih mreža. Ova složenost stvara potrebu za slojem orkestracije koji osigurava funkcionisanje celokupnog sistema, posebno kada je reč o operacijama kritičnim za bezbednost. Istovremeno, nameću se novi izazovi u praksi projektovanja sistema i izazov da javnost prihvati ove sisteme kao bezbedne. </p> <p> Pouzdanost, sigurnost, održivost, dostupnost i bezbednost - pet su atributa presudnih za izgradnju sistema koji mogu pružati usluge tokom dugog vremenskog perioda (razvojnog ciklusa proizvoda). MotionWise™ je upravo takva embedded platforma - sposobna da podrži bezbedonosno-kritične (safety critical) i vremenski-inicirane (time-triggered) procese, kao i bezbedan rad u slučaju otkaza (fail-operational), sve u strogom realnom vremenu. </p> <hr /> <p> Vozila sa visokim nivoom automatizacije su značajna tehnološka inovacija i evolutivni skok u automobilskoj industriji. Osnovna promena paradigme unutar E/E arhitekture vozila je u tome što se prelazi sa namenskog, fragmentiranog sistema zasnovanog na hardveru, na softverski definisanu, konvergentnu arhitekturu. Broj namenskih funkcija automatizovanog softvera za vožnju, i složenost uzrokovana najnovijim zahtevima osnovnog hardvera, operativnih sistema i komunikacionih mreža brzo raste. </p> <div class='intro-testemonials-img-cars'> <img src='../img/blog/Auto-industry-evolution-1.png' alt='Auto industry evolution | AutomotiveHires2021 ' /> </div> <p> Ovaj evolutivni skok u velikoj meri redefiniše konkurentni pejzaž cele industrije, i postavlja mnoge izazove sa kojima se industrija danas suočava. Najveći izazov su zahtevi za funkcionalnu bezbednost i operativne performanse sistema u slučaju otkaza, upareni sa najvišim nivoima složenosti. Lanac vrednosti u automobilskoj industriji se menja, a na tržište dolaze novi igrači kao što su softverske kompanije koje donose različite prakse saradnje. </p> <p> Izveštaj McKinsey and Company 2019, fokusiran na razvoj automobilskog softvera i elektronike do 2030. godine, to potvrđuje: „U narednim godinama softver će postati jedno od strateških razvojnih područja za automobilski sektor.“ Iz grafičkog prikaza ispod, vidljivo je da se očekuje da će ulaganja u razvoj rešenja softverske platforme rasti u budućnosti. ADAS sistemi postaju sve složeniji i uključuju sve veći broj različitih interaktivnih elemenata. Svi ovi elementi moraju da pruže zadovoljavajuće performanse kritične za bezbedenost i u slučaju otkaza, kako bi u javnosti bili prihvaćeni kao bezbedni i kao takvi imali osnovu da uđu u širu upotrebu. </p> <div class='intro-testemonials-img-medium'> <img src='../img/blog/SW-market-2.jpg' alt='Auto industry evolution | AutomotiveHires2021 ' /> </div> <hr /> <p> MotionWise™ je bezbedonosna softverska platforma čiji je cilj da podrži najviše nivoe automatizovane vožnje. Ona osigurava da svi delovi složenog računarskog sistema u realnom vremenu interaguju na predvidiv i usklađen način bez neželjene interferencije. MotionWise™ se zasniva na vremenski svesnom pristupu, generalizovanoj varijanti vremenski-inicirane (time-triggered) tehnologije, koja omogućava determinističko ponašanje čitavog sistema. U skladu je sa ASIL D (nivo integriteta bezbednosti u auto industriji), najvišim nivoom bezbednosti ISO 26262 - standard funkcionalne bezbednosti za drumska vozila. </p> <div class='intro-testemonials-text'> <img src='../img/blog/AutomotiveHires2021-5.png' alt='' /> </div> <p> Iz perspektive softvera, možemo reći da softver „razmišlja u slojevima“. Ako ih odozgo nadole definišemo kao aplikativni sloj, sloj bezbedonosne platforme, sloj operativnog sistema i sloj komunikacionih protokola, grubo govoreći, MotionWise™ bi bio centralni sloj orkestracije koji obezbeđuje predvidiv i bezbedan rad sistema. Platforma nudi okvir za efikasno funkcionisanje aplikacija sa implementiranim rasporedima, komunikacijom i drugim mehanizmima. </p> <p> Svojom dizajnom distribuirane arhitekture (in-vehicle distributed architecture), platforma je u skladu sa AUTOSAR specifikacijom i skalabilna je. Mrežna komunikacija je zasnovana na real-time eternetu kako bi se zadovoljili komunikacioni zahtevi u realnom vremenu „s kraja na kraj“ (end-to-end) i kritične kontrolne putanje. Sistem je heterogen, sačinjen od različitih višejezgarnih čipova. </p> <!--Table grid--> <div class='table-4'> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-1.png' alt='Višejezgarna - procesorska arhitektura' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> Višejezgarna/ <br /> procesorska arhitektura </h3> </div> <div class='table-4-item__intro'> <p> Podrška za višejezgarni ARM SIP, namenski vision processing ASIC, real-time MCU. Zadovoljava AUTOSAR i Adaprive AUTOSAR standarde. </p> </div> </div> </div> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-2.png' alt='ASIL-D Functional Safety' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> ASIL-D <br /> Functional Safety </h3> </div> <div class='table-4-item__intro'> <p> Analiza funkcionalne bezbednosti (system level cross-functional module) i višenivojka deployment strategija. Podrška za Fail-Silent/Fail-Operational. </p> </div> </div> </div> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-3.png' alt='Pouzdan real-time sistem' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> Pouzdan real-time <br /> sistem </h3> </div> <div class='table-4-item__intro'> <p> Višejezgarna alokacija taskova i raspoređivanje bazirano na RTOS (OSEK, QNX) time-triggered eternet komunikaciji baziranoj na master/slave clock sinhronizaciji i zaštiti. </p> </div> </div> </div> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-4.png' alt='' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> Visoko-skalabilna <br /> platforma </h3> </div> <div class='table-4-item__intro'> <p> Podrška za cross-hardware platforme (MCU, ARM, GPU, etc.) RTE middleware i interfejsi. Standardizovan i prilagodljiv modul za podršku AD nivoa 2 do 5. </p> </div> </div> </div> </div> <!-- End Table Grid--> <p> MotionWise™ je dakle, bezbedonosna softverska platforma koja bezbednost garantuje samim svojim dizajnom. Ona garantuje bezbedan rad u slučaju otkaza (fail-operational performanse) istovremeno upravljajući visokom kompleksnošću elemenata platforme. Kao rezultat svega toga, korištenjem MotionWise™ platforme za razvoj, OEM i Tier1 kompanije skraćuju vreme (time-to-market) svojih projekata za autonomnu vožnju i povećavaju njihovu kompetitivnost uz niže troškove izrade. </p> <p> <small >*Delovi teksta preuzeti sa <a href='https://www.tttech-auto.com/' target='_blank' >TTTech Auto</a >.</small > </p>"
    },
    {
      "id": 2,
      "title": "Real-time automotive – 2",
      "title2": "Title2",
      "excerpt": "U sledećoj deceniji automobilska industrija će se suočiti sa razmerama promena koje nisu viđene zadnjih 100 godina. <br>Ovu promenu će pokretati prvenstveno četiri međusobno jačajuća trenda, tj. koncept autonomnih, povezanih, električnih i deljenih vozila <br> (autonomous, connected, electrical, shared - ACES)",
      "text": "Pouzdanost, sigurnost, održivost, dostupnost i bezbednost - pet su atributa presudnih za izgradnju sistema koji mogu pružati uslugetokom dugog vremenskog perioda (razvojnog ciklusa proizvoda).MotionWise™ je upravo takva embedded platforma - sposobna da podržibezbedonosno-kritične (safety critical) i vremenski-inicirane(time-triggered) procese, kao i bezbedan rad u slučaju otkaza(fail-operational), sve u strogom realnom vremenu."
    }
  ]
}
