{
  "Todos": [
    {
      "id": 1,
      "todo": "Check Todo"
    },
    {
      "id": 2,
      "todo": "New Todo"
    }
  ],
  "Books": [
    {
      "id": 1,
      "name": "dorucak u Trstu"
    }
  ],
  "Blogs": [
    {
      "id": 1,
      "title": "Real-time automotive – bezbedni sistemi budućnosti",
      "title2": "MotionWise",
      "blogText": "<h3 class='intro-testimonials-logo'>MotionWise<sup>TM</sup></h3> <h2 class='black center-text mb-3 mt-4'> Real-time automotive – bezbedni sistemi budućnosti </h2> <p class='black light-text pl-2' style='text-align: center'><em> „U sledećoj deceniji automobilska industrija će se suočiti sa razmerama promena koje nisu viđene zadnjih 100 godina. <br>Ovu promenu će pokretati prvenstveno četiri međusobno jačajuća trenda, tj. koncept autonomnih, povezanih, električnih i deljenih vozila <br> (autonomous, connected, electrical, shared - ACES) “. </em> </p> <p> Jedan od ključnih faktora koji doprinose snažnom ukupnom rastu tržišta softvera je povećanje njegove složenosti u domenima na koje najviše utiču ACES trendovi. U autonomnoj vožnji složenost je uzrokovana sve većim brojem namenskih funkcija automatizovanog softvera za vožnju, kao i složenošću osnovnog hardvera, operativnih sistema i komunikacionih mreža. Ova složenost stvara potrebu za slojem orkestracije koji osigurava funkcionisanje celokupnog sistema, posebno kada je reč o operacijama kritičnim za bezbednost. Istovremeno, nameću se novi izazovi u praksi projektovanja sistema i izazov da javnost prihvati ove sisteme kao bezbedne. </p> <p> Pouzdanost, sigurnost, održivost, dostupnost i bezbednost - pet su atributa presudnih za izgradnju sistema koji mogu pružati usluge tokom dugog vremenskog perioda (razvojnog ciklusa proizvoda). MotionWise™ je upravo takva embedded platforma - sposobna da podrži bezbedonosno-kritične (safety critical) i vremenski-inicirane (time-triggered) procese, kao i bezbedan rad u slučaju otkaza (fail-operational), sve u strogom realnom vremenu. </p> <hr /> <p> Vozila sa visokim nivoom automatizacije su značajna tehnološka inovacija i evolutivni skok u automobilskoj industriji. Osnovna promena paradigme unutar E/E arhitekture vozila je u tome što se prelazi sa namenskog, fragmentiranog sistema zasnovanog na hardveru, na softverski definisanu, konvergentnu arhitekturu. Broj namenskih funkcija automatizovanog softvera za vožnju, i složenost uzrokovana najnovijim zahtevima osnovnog hardvera, operativnih sistema i komunikacionih mreža brzo raste. </p> <div class='intro-testemonials-img-cars'> <img src={'../img/blog/Auto-industry-evolution-1.png' alt='Auto industry evolution | AutomotiveHires2021 ' /> </div> <p> Ovaj evolutivni skok u velikoj meri redefiniše konkurentni pejzaž cele industrije, i postavlja mnoge izazove sa kojima se industrija danas suočava. Najveći izazov su zahtevi za funkcionalnu bezbednost i operativne performanse sistema u slučaju otkaza, upareni sa najvišim nivoima složenosti. Lanac vrednosti u automobilskoj industriji se menja, a na tržište dolaze novi igrači kao što su softverske kompanije koje donose različite prakse saradnje. </p> <p> Izveštaj McKinsey and Company 2019, fokusiran na razvoj automobilskog softvera i elektronike do 2030. godine, to potvrđuje: „U narednim godinama softver će postati jedno od strateških razvojnih područja za automobilski sektor.“ Iz grafičkog prikaza ispod, vidljivo je da se očekuje da će ulaganja u razvoj rešenja softverske platforme rasti u budućnosti. ADAS sistemi postaju sve složeniji i uključuju sve veći broj različitih interaktivnih elemenata. Svi ovi elementi moraju da pruže zadovoljavajuće performanse kritične za bezbedenost i u slučaju otkaza, kako bi u javnosti bili prihvaćeni kao bezbedni i kao takvi imali osnovu da uđu u širu upotrebu. </p> <div class='intro-testemonials-img-medium'> <img src='../img/blog/SW-market-2.jpg' alt='Auto industry evolution | AutomotiveHires2021 ' /> </div> <hr /> <p> MotionWise™ je bezbedonosna softverska platforma čiji je cilj da podrži najviše nivoe automatizovane vožnje. Ona osigurava da svi delovi složenog računarskog sistema u realnom vremenu interaguju na predvidiv i usklađen način bez neželjene interferencije. MotionWise™ se zasniva na vremenski svesnom pristupu, generalizovanoj varijanti vremenski-inicirane (time-triggered) tehnologije, koja omogućava determinističko ponašanje čitavog sistema. U skladu je sa ASIL D (nivo integriteta bezbednosti u auto industriji), najvišim nivoom bezbednosti ISO 26262 - standard funkcionalne bezbednosti za drumska vozila. </p> <div class='intro-testemonials-text'> <img src='../img/blog/AutomotiveHires2021-5.png' alt='' /> </div> <p> Iz perspektive softvera, možemo reći da softver „razmišlja u slojevima“. Ako ih odozgo nadole definišemo kao aplikativni sloj, sloj bezbedonosne platforme, sloj operativnog sistema i sloj komunikacionih protokola, grubo govoreći, MotionWise™ bi bio centralni sloj orkestracije koji obezbeđuje predvidiv i bezbedan rad sistema. Platforma nudi okvir za efikasno funkcionisanje aplikacija sa implementiranim rasporedima, komunikacijom i drugim mehanizmima. </p> <p> Svojom dizajnom distribuirane arhitekture (in-vehicle distributed architecture), platforma je u skladu sa AUTOSAR specifikacijom i skalabilna je. Mrežna komunikacija je zasnovana na real-time eternetu kako bi se zadovoljili komunikacioni zahtevi u realnom vremenu „s kraja na kraj“ (end-to-end) i kritične kontrolne putanje. Sistem je heterogen, sačinjen od različitih višejezgarnih čipova. </p> <!--Table grid--> <div class='table-4'> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-1.png' alt='Višejezgarna - procesorska arhitektura' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> Višejezgarna/ <br /> procesorska arhitektura </h3> </div> <div class='table-4-item__intro'> <p> Podrška za višejezgarni ARM SIP, namenski vision processing ASIC, real-time MCU. Zadovoljava AUTOSAR i Adaprive AUTOSAR standarde. </p> </div> </div> </div> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-2.png' alt='ASIL-D Functional Safety' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> ASIL-D <br /> Functional Safety </h3> </div> <div class='table-4-item__intro'> <p> Analiza funkcionalne bezbednosti (system level cross-functional module) i višenivojka deployment strategija. Podrška za Fail-Silent/Fail-Operational. </p> </div> </div> </div> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-3.png' alt='Pouzdan real-time sistem' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> Pouzdan real-time <br /> sistem </h3> </div> <div class='table-4-item__intro'> <p> Višejezgarna alokacija taskova i raspoređivanje bazirano na RTOS (OSEK, QNX) time-triggered eternet komunikaciji baziranoj na master/slave clock sinhronizaciji i zaštiti. </p> </div> </div> </div> <div class='table-4-item'> <div class='table-4-item__image'> <img src='../img/blog/icon-4.png' alt='' /> </div> <div class='table-4-item__content'> <div class='table-4-item__heading'> <h3> Visoko-skalabilna <br /> platforma </h3> </div> <div class='table-4-item__intro'> <p> Podrška za cross-hardware platforme (MCU, ARM, GPU, etc.) RTE middleware i interfejsi. Standardizovan i prilagodljiv modul za podršku AD nivoa 2 do 5. </p> </div> </div> </div> </div> <!-- End Table Grid--> <p> MotionWise™ je dakle, bezbedonosna softverska platforma koja bezbednost garantuje samim svojim dizajnom. Ona garantuje bezbedan rad u slučaju otkaza (fail-operational performanse) istovremeno upravljajući visokom kompleksnošću elemenata platforme. Kao rezultat svega toga, korištenjem MotionWise™ platforme za razvoj, OEM i Tier1 kompanije skraćuju vreme (time-to-market) svojih projekata za autonomnu vožnju i povećavaju njihovu kompetitivnost uz niže troškove izrade. </p> <p> <small >*Delovi teksta preuzeti sa <a href='https://www.tttech-auto.com/' target='_blank' >TTTech Auto</a >.</small > </p>"
    },
    {
      "id": 2,
      "title": "The story behind the business with Danijel Spasojevic",
      "title2": "Od početaka do danasdadfcads",
      "excerpt": "Najimpresivnije je bilo videti kako kroz sve ovo stasavaju ljudi, kako nam raste znanje i kako oni koji su pratili, postaju oni koji vode. Neki su sada perjanice velikih svetskih firmi, neki su i dalje ovde i vode timove i projekte ili prave nove funkcionalnosti i unapređuju postojeće, a sve ih spaja jedna stvar - a to je iskustvo i znanje koje su stekli ovde",
      "blogText": " <h2 class='black center-text mb-3 mt-4'> The story behind the business with Danijel Spasojevic </h2> <p class='black light-text pl-2' style='text-align: center'><em> „Najimpresivnije je bilo videti kako kroz sve ovo stasavaju ljudi, kako nam raste znanje i kako oni koji su pratili, postaju oni koji vode. <br> Neki su sada perjanice velikih svetskih firmi, neki su i dalje ovde i vode timove i projekte ili prave nove funkcionalnosti i unapređuju postojeće, <br> a sve ih spaja jedna stvar - a to je iskustvo i znanje koje su stekli ovde“, <br> <br>Danijel Spasojević – VP Automotive Customer Programs at RT-RK Automotive/VP CP&E Internal Services at TTTech Auto </em> </p> <p> Kao kompanija koja se trideset godina bavi embedded sistemima i softverom, mogu da kažem da smo uvek imali talenat da odaberemo najizazovnije projekte koji su često u startu izgledali kao nemoguća misija. Čisto da se razumemo, izazov je ona lepa reč koju mi menadžeri rado koristimo da ne bismo rekli neku ružniju, pardon izazovniju &#128512;. </p> <p> Kada smo te, sad već daleke 2014. godine zajedno sa TTTech-om iz Austrije, krenuli u priču razvoja softverske platforme za napredne sisteme podrške vozaču (ADAS) i autonomnu vožnju, delovalo mi je da smo apsolutno nedorasli izazovu. Nije to bilo daleko od istine - sve nam je bilo novo, novi hardver, novi operativni sistemi i razvojne metodologije, novi procesi i nov klijent, zahtevan i neumoljiv. Sistem je bio nešto najkompleksnije sto smo do tad videli, 4 multicore procesora sa 4 potpuno različita operativna sistema, u determinističkom, bezbednosno-kritičnom sistemu. Neki od tih procesora su bili u tako ranoj fazi razvoja da su raspoloživi primerci bili ređi od sedmice na Lotu. Arhitektura softvera u startu, tek par blokova povezanih strelicama na papiru, brzo je rasla i usložnjavala se, a mi smo od jednog čoveka po bloku došli do toga da imamo po ceo tim. Mnogo linija koda, nekoliko desetina releasova i puno sati, dana, godina rada kasnije, Audi A8, tehnološko čudo na točkovima, prikazano je javnosti. Prvi serijski automobil na svetu sa Level 3 mogućnostima autonomije! I naš ne mali doprinos da se to desi! Za njim jos dvadesetak premium vozila iz VAG (Volkswagen Group) radionice i još uvek izlaze nova… </p> <div class='intro-testemonials-img-cars'> <img src='../img/blog/danijel-spasojevic-1.jpg' alt='AutomotiveHires2021 ' /> </div> <p> Danas, nekoliko godina kasnije, retko ko se priseća prekovremenih sati i rada vikendom, ali svi se rado sete kako je bilo putovati u Ingolštat i Beč, debagovati rame uz rame sa inženjerima Audija i TTTech-a, voziti se na testnom poligonu, učiti od najboljih, učestvovati u nečemu što zaista teži da promeni svet. Prosto je neverovatno kako teška, pardon, izazovna vremena postanu dobra stara vremena. Posle Audija došao je SAIC, jedan od velikih proizvođača automobila u Kini, a naš kod i znanje, počeli su dobijati oblik proizvoda - MotionWise™, platformskog softvera za sisteme autonomne vožnje i ADAS. Baziran na AUTOSAR arhitekturi ali sa značajnim unapređenjima koja proširuju funkcionalnost, podižu bezbednost i olakšavaju integraciju. A potom Porsche, Hyundai (sa sve Kia-om), pa konačno nova generacija Volkswagen/Audi vozila. Ipak treba nešto staviti i u novi Audi A8 - ne može više fail-silent, mora fail-operational, nije više AUTOSAR Classic, mora da bude Service Oriented Architecture i Adaptive AUTOSAR. Infineon, Renesas, nVidia, Texas Instruments, NXP, Intel - generacija za generacijom automotive SoC-ova prolazila nam je kroz ruke i uvek smo bili među prvima koji ih vide. </p> <p> Najimpresivnije je ipak, za sve ove godine, bilo videti kako kroz sve ovo stasavaju ljudi, kako se povećava količina znanja i kako oni koji su pratili, postaju oni koji vode. Neki su sada perjanice velikih svetskih firmi, neki su i dalje ovde i vode timove i projekte ili prave nove funkcionalnosti i unapređuju postojeće, a sve ih spaja jedna stvar - a to je iskustvo i znanje koje su stekli ovde. </p> "
    },
    {
      "title": "Naslov Test1",
      "title2": "Naslov test 2",
      "blogText": "<h3>Bakuta</h3>",
      "id": 3
    },
    {
      "title": "Test 35",
      "title2": "Test 3 Subtitle",
      "excerpt": "Test 3 Excerpt",
      "blogText": "Some text here",
      "id": 4
    },
    {
      "title": "Novi Post gggg",
      "title2": "Post novi skroz",
      "excerpt": "Evo",
      "blogText": "Tekstovi Novi",
      "id": 5
    },
    {
      "title": "V24",
      "title2": "Tata",
      "excerpt": "Mama ",
      "blogText": "BAta",
      "id": 6
    }
  ]
}